---
kind: other
id: Methods.T:Autodesk.Revit.DB.AreaVolumeSettings
source: html/3accb536-c914-3581-bb80-1244b1522230.htm
---
# AreaVolumeSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.